astrogrid/vospace/delegate/notes/fault.txt

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
  <PullFromVoSpace xsi:type="ns1:PullFromVoSpaceRequestType" xmlns="http://www.ivoa.net/xml/VOSpaceContract-v1.1-rc2" xmlns:ns1="http://www.ivoa.net/xml/VOSpaceTypes-v1.1-rc2">
   <ns1:source xsi:type="xsd:anyURI">vos://org.astrogrid.test!vospace-service/03efc4cd1c11d75c011c4a03acff0a1d/tree/file</ns1:source>
   <ns1:transfer xsi:type="ns1:TransferType">
    <ns1:view original="false" uri="ivo://org.astrogrid.vospace/view/default" xsi:type="ns1:ViewType"/>
    <ns1:protocol uri="ivo://org.astrogrid.vospace/protocol/http-get" xsi:type="ns1:ProtocolType"/>
   </ns1:transfer>
  </PullFromVoSpace>
 </soapenv:Body>
</soapenv:Envelope>HTTP/1.1 500 Internal Server Error
Server: Apache-Coyote/1.1
Content-Type: text/xml;charset=utf-8
Date: Wed, 10 Sep 2008 02:07:46 GMT
Connection: close

<?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><soapenv:Fault><faultcode>soapenv:Server.generalException</faultcode><faultstring></faultstring><detail><ns1:InvalidUriFault xmlns:ns1="http://www.ivoa.net/xml/VOSpaceContract-v1.1-rc2"><ns2:value xsi:nil="true" xmlns:ns2="http://www.ivoa.net/xml/VOSpaceTypes-v1.1-rc2"/></ns1:InvalidUriFault><string>Cannot initialize URI with empty parameters.</string></detail></soapenv:Fault></soapenv:Body></soapenv:Envelope>


Testsuite: org.astrogrid.vospace.client.delegate.AGVOSpaceDelegateTestCase
Tests run: 2, Failures: 0, Errors: 1, Time elapsed: 4.86 sec

Testcase: testExportNewFileNode(org.astrogrid.vospace.client.delegate.AGVOSpaceDelegateTestCase):	Caused an ERROR
null
org.astrogrid.vospace.v11.client.exception.axis.AxisRequestException
	at org.astrogrid.vospace.v11.client.endpoint.EndpointDelegateImpl.export(EndpointDelegateImpl.java:1003)
	at org.astrogrid.vospace.v11.client.service.ServiceDelegateImpl.export(ServiceDelegateImpl.java:503)
	at org.astrogrid.vospace.v11.client.system.SystemDelegateImpl.export(SystemDelegateImpl.java:916)
	at org.astrogrid.vospace.v11.client.system.SystemDelegateImpl.export(SystemDelegateImpl.java:873)
	at org.astrogrid.vospace.v11.client.system.SystemDelegateImpl.export(SystemDelegateImpl.java:816)
	at org.astrogrid.vospace.client.delegate.AGVOSpaceDelegateTestCase.testExportNewFileNode(AGVOSpaceDelegateTestCase.java:333)
	at sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)
	at sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:25)
Caused by: 
	at sun.reflect.NativeConstructorAccessorImpl.newInstance0(Native Method)
	at sun.reflect.NativeConstructorAccessorImpl.newInstance(NativeConstructorAccessorImpl.java:39)
	at sun.reflect.DelegatingConstructorAccessorImpl.newInstance(DelegatingConstructorAccessorImpl.java:27)
	at java.lang.reflect.Constructor.newInstance(Constructor.java:513)
	at java.lang.Class.newInstance0(Class.java:355)
	at java.lang.Class.newInstance(Class.java:308)
	at org.apache.axis.encoding.ser.BeanDeserializer.<init>(BeanDeserializer.java:104)
	at org.apache.axis.encoding.ser.BeanDeserializer.<init>(BeanDeserializer.java:90)
	at net.ivoa.vospace.v11.type.InvalidUriFaultType.getDeserializer(InvalidUriFaultType.java:118)
	at sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:39)
	at sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:25)
	at org.apache.axis.encoding.ser.BaseDeserializerFactory.getSpecialized(BaseDeserializerFactory.java:154)
	at org.apache.axis.encoding.ser.BaseDeserializerFactory.getDeserializerAs(BaseDeserializerFactory.java:84)
	at org.apache.axis.encoding.DeserializationContext.getDeserializer(DeserializationContext.java:464)
	at org.apache.axis.encoding.DeserializationContext.getDeserializerForType(DeserializationContext.java:547)
	at org.apache.axis.message.SOAPFaultDetailsBuilder.onStartChild(SOAPFaultDetailsBuilder.java:157)
	at org.apache.axis.encoding.DeserializationContext.startElement(DeserializationContext.java:1035)
	at org.apache.xerces.parsers.AbstractSAXParser.startElement(Unknown Source)
	at org.apache.xerces.impl.XMLNSDocumentScannerImpl.scanStartElement(Unknown Source)
	at org.apache.xerces.impl.XMLDocumentFragmentScannerImpl$FragmentContentDispatcher.dispatch(Unknown Source)
	at org.apache.xerces.impl.XMLDocumentFragmentScannerImpl.scanDocument(Unknown Source)
	at org.apache.xerces.parsers.XML11Configuration.parse(Unknown Source)
	at org.apache.xerces.parsers.DTDConfiguration.parse(Unknown Source)
	at org.apache.xerces.parsers.XMLParser.parse(Unknown Source)
	at org.apache.xerces.parsers.AbstractSAXParser.parse(Unknown Source)
	at javax.xml.parsers.SAXParser.parse(SAXParser.java:395)
	at org.apache.axis.encoding.DeserializationContext.parse(DeserializationContext.java:227)
	at org.apache.axis.SOAPPart.getAsSOAPEnvelope(SOAPPart.java:696)
	at org.apache.axis.Message.getSOAPEnvelope(Message.java:424)
	at org.apache.axis.handlers.soap.MustUnderstandChecker.invoke(MustUnderstandChecker.java:62)
	at org.apache.axis.client.AxisClient.invoke(AxisClient.java:206)
	at org.apache.axis.client.Call.invokeEngine(Call.java:2765)
	at org.apache.axis.client.Call.invoke(Call.java:2748)
	at org.apache.axis.client.Call.invoke(Call.java:2424)
	at org.apache.axis.client.Call.invoke(Call.java:2347)
	at org.apache.axis.client.Call.invoke(Call.java:1804)
	at net.ivoa.vospace.v11.port.VOSpaceBindingStub.pullFromVoSpace(VOSpaceBindingStub.java:2207)
	at org.astrogrid.vospace.v11.client.endpoint.EndpointDelegateImpl.export(EndpointDelegateImpl.java:971)
	... 19 more


